ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/I2S1_1.0.xml
        <register id="I2S1_RIS" width="32" offset="0x10" description="This registers gives the raw interrupt status">
            <bitfield id="WCLKERR" description="This interrupt is set when: 
- An unexpected **WCLK** edge occurs during the data delay period of a phase.  Note unexpected **WCLK** edges during the word and idle periods of the phase are not detected.
-  In dual-phase mode, when two **WCLK** edges are less than 4 **BCLK** cycles apart.
-  In single-phase mode, when a **WCLK** pulse occurs before the last channel.
This error requires a complete restart since word synchronization has been lost." begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RXINT" description="Receive Interrupt." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="TXINT" description="Transmit Interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="TX FIFO Underflow Interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="I2S1_MIS" width="32" offset="0x18" description="This registers gives the raw interrupt status">
            <bitfield id="WCLKERR" description="This interrupt is set when: 
- An unexpected **WCLK** edge occurs during the data delay period of a phase.  Note unexpected **WCLK** edges during the word and idle periods of the phase are not detected.
-  In dual-phase mode, when two **WCLK** edges are less than 4 **BCLK** cycles apart.
-  In single-phase mode, when a **WCLK** pulse occurs before the last channel.
This error requires a complete restart since word synchronization has been lost." begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RXINT" description="Masked Receive Interrupt." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="TXINT" description="Masked Transmit Interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="Masked DMA Done on RX Event Channel Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="Masked DMA Done on TX Event Channel Interrupt" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="Masked RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="TX FIFO underflow interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="I2S1_ISET" width="32" offset="0x20" description="Interrupt Set Register. This register can be used by software for diagnostics and safety checking purposes.">
            <bitfield id="WCLKERR" description="This field sets the interrupt WCLKERR" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOEFF" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="RXINT" description="Set Receive Interrupt." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="TXINT" description="Set Transmit Interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="Set RXFIFO overflow event." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="Set TX FIFO Underflow Event" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
        </register>
        <register id="I2S1_ICLR" width="32" offset="0x28" description="Interrupt clear register. This register allows software to clear interrupts.">
            <bitfield id="WCLKERR" description="This field clears the interrupt WCLKERR" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOEFF" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="RXINT" description="Clear Receive Interrupt." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TXINT" description="Clear Transmit Interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="Clear RXFIFO overflow event." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="Clear TXFIFO underflow event" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
        </register>
