ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/I2S1_1.0.xml
        </group>
    <group id="I2S1_SPGDMA" name="I2S1_SPGDMA" instances="1" offset="0x10B0" instaddr="0x20" description="">
        <register id="I2S1_SPGDMARXSZ" width="32" offset="0x0" description="DMA Channel Size">
            <bitfield id="SIZE" description="DMA Channel Size in number of transfers" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2S1_SPGDMARXDA" width="32" offset="0x4" description="DMA Channel Destination Address">
            <bitfield id="ADDR" description="DMA Channel Destination Address" begin="31" end="0" width="32" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2S1_SPGDMARXCTL" width="32" offset="0x8" description="DMA Channel Control">
            <bitfield id="DMAEN" description="DMA enable" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="DMA channel disabled"/>
                <bitenum id="ENABLE" value="0x1" description="DMA channel enabled"/>
            </bitfield>
            <bitfield id="DMAMEMINCR" description="DMA destination increment. This bit selects automatic incrementing or decrementing of the destination address DMADA for each transfer. The amount of change to the DMADA is based on the definitin in the DMADSTWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMADA by 4." begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="INCREMENT" value="0x0" description="Incremented by 1 (+1 * DMADSTWDTH)"/>
                <bitenum id="DECREMENT" value="0x1" description="Decremented by 1 (-1 * DMADSTWDTH)"/>
            </bitfield>
            <bitfield id="DMAPREIRQ" description="Enable an early IRQ event. This can help software to react quicker to and DMA done event or allows some additional configuration before the channel is complete. 

Note: This register is only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC configuration this register is a read only value and always reads as 0x0." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="PREIRQ_DISABLE" value="0x0" description="Pre-IRQ event disabled."/>
                <bitenum id="PREIRQ_HALF" value="0x1" description="Issure Pre-IRQ event when DMASZ reached the half size point of the original transfer size"/>
            </bitfield>
            <bitfield id="DMATM" description="DMA transfer mode register" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="SINGLE" value="0x0" description="Single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated and the DMAEN is cleared."/>
                <bitenum id="RPTSNGL" value="0x1" description="Repeated single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated. After the last transfer the DMASA, DMADA, DAMSZ registers are restored to its initial value and the DMAEN stays enabled."/>
            </bitfield>
            <bitfield id="DMADSTWDTH" description="DMA destination width. This bit selects the destination as a byte, half word, word or long word." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="BYTE" value="0x0" description="Destination data width is BYTE (8-bit)"/>
                <bitenum id="HALF" value="0x1" description="Destination data width is HALF-WORD (16-bit)"/>
                <bitenum id="WORD" value="0x2" description="Destination data width is WORD (32-bit)"/>
            </bitfield>
        </register>
        <register id="I2S1_SPGDMATXSZ" width="32" offset="0x10" description="DMA Channel Size">
            <bitfield id="SIZE" description="DMA Channel Size in number of transfers" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2S1_SPGDMATXSA" width="32" offset="0x14" description="DMA Channel Destination Address">
            <bitfield id="ADDR" description="DMA Channel Destination Address" begin="31" end="0" width="32" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2S1_SPGDMATXCTL" width="32" offset="0x18" description="DMA Channel Control">
            <bitfield id="DMAEN" description="DMA enable" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="DMA channel disabled"/>
                <bitenum id="ENABLE" value="0x1" description="DMA channel enabled"/>
            </bitfield>
            <bitfield id="DMAMEMINCR" description="DMA destination increment. This bit selects automatic incrementing or decrementing of the destination address DMADA for each transfer. The amount of change to the DMADA is based on the definitin in the DMADSTWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMADA by 4." begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="INCREMENT" value="0x0" description="Incremented by 1 (+1 * DMASRCWDTH)"/>
                <bitenum id="DECREMENT" value="0x1" description="Decremented by 1 (-1 * DMASRCWDTH)"/>
            </bitfield>
            <bitfield id="DMAPREIRQ" description="Enable an early IRQ event. This can help software to react quicker to and DMA done event or allows some additional configuration before the channel is complete. 

Note: This register is only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC configuration this register is a read only value and always reads as 0x0." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="PREIRQ_DISABLE" value="0x0" description="Pre-IRQ event disabled."/>
                <bitenum id="PREIRQ_HALF" value="0x1" description="Issure Pre-IRQ event when DMASZ reached the half size point of the original transfer size"/>
            </bitfield>
            <bitfield id="DMATM" description="DMA transfer mode register

Note: The repeat-single (2h) and repeat-block (3h) transfer are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration only the values for single (0h) and block (1h) transfer can be set." begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="SINGLE" value="0x0" description="Single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated and the DMAEN is cleared."/>
                <bitenum id="RPTSNGL" value="0x1" description="Repeated single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated. After the last transfer the DMASA, DMADA, DAMSZ registers are restored to its initial value and the DMAEN stays enabled."/>
            </bitfield>
            <bitfield id="DMASRCWDTH" description="DMA source width. This bit selects the source data width as a byte, half word, word or long word." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="BYTE" value="0x0" description="Source data width is BYTE (8-bit)"/>
                <bitenum id="HALF" value="0x1" description="Source data width is HALF-WORD (16-bit)"/>
                <bitenum id="WORD" value="0x2" description="Source data width is WORD (32-bit)"/>
            </bitfield>
        </register>
