ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/I2S1_1.0.xml
        </group>
    <register id="I2S1_INTCTL" width="32" offset="0x10E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
    <register id="I2S1_FMTCFG" width="32" offset="0x1100" description="This register configures the serial interface format">
        <bitfield id="WORDLEN" description="Number of bits per word (8-32):
In single-phase format, this is the exact number of bits per word. 
In dual-phase format, this is the maximum number of bits per word.

Values below 8 and above 32 give undefined behavior. Data written to memory is always aligned to 16 or 32 bits as defined by [MEMLEN32]. Bit widths that differ from this alignment will either be truncated or zero padded." begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="DUALPHASE" description="This field selects between dual-phase or single-phase format" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SINGLEPHASE" value="0x0" description="Single-phase: **DSP** format"/>
            <bitenum id="DUALPHASE" value="0x1" description="Dual-phase: **I2S**, **LJF** and **RJF** formats"/>
        </bitfield>
        <bitfield id="SMPLEDGE" description="This field configures the sample edge/ transfer edge of data (and **WCLK**) on **BCLK**" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NEGEDGE" value="0x0" description="Data is sampled on the negative edge and clocked out on the positive edge."/>
            <bitenum id="POSEDGE" value="0x1" description="Data is sampled on the positive edge and clocked out on the negative edge."/>
        </bitfield>
        <bitfield id="MEMLEN32" description="This register configures the size of each word stored to or loaded from memory" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="16BIT" value="0x0" description="16-bit (one 16 bit access per sample)"/>
            <bitenum id="32BIT" value="0x1" description="32-bit(one 32-bit access per sample)"/>
        </bitfield>
        <bitfield id="DATADLY" description="This field configures the number of **BCLK** periods between a **WCLK** edge and **MSB** of the first word in a phase

Note: When 0, **MSB** of the next word will be output in the idle period between **LSB** of the previous word and the start of the next word. Otherwise logical 0 will be output until the data delay has expired." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Zero **BCLK** periods - **LJF** and **DSP** formats"/>
            <bitenum id="ONE" value="0x1" description="One **BCLK** periods - **I2S** and **DSP** formats"/>
            <bitenum id="TWO" value="0x2" description="Two(Min) **BCLK** periods - **RJF** format"/>
            <bitenum id="MAX" value="0xFF" description="Max(255) **BCLK** periods - **RJF** format"/>
        </bitfield>
        <bitfield id="SUSPEND" description="Suspend external communication" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Functional mode resumed"/>
            <bitenum id="ENABLE" value="0x1" description="External communication suspended"/>
        </bitfield>
        <bitfield id="ENABLE" description="I2S Module Enable.  
    If the I2S is disabled in the middle of transmission or reception, it completes the current character before stopping. 
    If ENABLE bit is not set, all registers can still be accessed and updated. It is recommended to setup and change I2S operation mode whhile ENABLE bit is cleared to avoid unpredictable behavior during setup or update.
    If disabled,  I2S module will not send or receive any data." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Module"/>
            <bitenum id="ENABLE" value="0x1" description="Enable module"/>
        </bitfield>
        <bitfield id="EMPTYSLOTOUTPUT" description="The field configures the **EMPTYSLOTOUTPUT** data pin direction" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="zero" value="0x0" description="Send out zeroes in empty slots"/>
            <bitenum id="one" value="0x1" description="send out ones in empty slot"/>
            <bitenum id="Tristate" value="0x2" description="Tristate line during empty slot"/>
            <bitenum id="RESERVED" value="0x3" description="Reserved"/>
        </bitfield>
    </register>
    <register id="I2S1_CLKCTL" width="32" offset="0x1104" description="This register controls internal audio clock">
        <bitfield id="WBEN" description="This field configures **WCLK**/**BCLK** generation" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disables the generation"/>
            <bitenum id="EN" value="0x1" description="Enable the generation"/>
        </bitfield>
        <bitfield id="WCLKPHASE" description="The field configures how the WCLK division ratio is calculated and used to generate different duty cycles (See [WCLKDIV.WDIV])" begin="2" end="1" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="MEN" description="This field configures the **MCLK** generation" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disable the generation"/>
            <bitenum id="EN" value="0x1" description="Enable the generation"/>
        </bitfield>
    </register>
    <register id="I2S1_STAT" width="32" offset="0x1108" description="UART Status Register">
        <bitfield id="TXFF" description="UART Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full."/>
        </bitfield>
        <bitfield id="RXFF" description="UART Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFE" description="UART Transmit FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter has data to transmit."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is empty. If the FIFO is enabled (FEN is 1), the transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="RXFE" description="UART Receive FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver is not empty."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is empty. If the FIFO is enabled (FEN is 1), the receive FIFO is empty."/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
    </register>
    <register id="I2S1_IFLS" width="32" offset="0x110C" description="UART Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="UART Receive Interrupt FIFO Level Select  The trigger points for the receive interrupt are as follows: 

