ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/I2S1_1.0.xml
    <register id="I2S1_MCLKDIV" width="32" offset="0x1160" description="This field configures **MCLK** division ratio">
        <bitfield id="MDIV" description="An unsigned factor of the division ratio used to generate **MCLK** [2-1024]:
                                            **MCLK** = MCUCLK/MDIV[Hz] **MCUCLK** is upto 96MHz. 
                                            A value of 0 is interpreted as 1024.
                                            A value of 1 is invalid. 
                                            If MDIV is odd the low phase of the clock is one **MCUCLK** period longer than the high phase." begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="I2S1_WCLKDIV" width="32" offset="0x1164" description="Configures WCLK division ratio">
        <bitfield id="WDIV" description="If[CLKCTL.WCLKPHASE]= 0, Single phase. **WCLK**is high one**BCLK**period and low WDIV[9:0] (unsigned, [1-1023])**BCLK**periods. 
                                           **WCLK**=**MCUCLK**/ BDIV*(WDIV[9:0] + 1) [Hz] **MCUCLK**upto 96MHz. 
                                           If[CLKCTL.WCLKPHASE.*]= 1, Dual phase. Each phase on**WCLK**(50% duty cycle) is WDIV[9:0] (unsigned, [1-1023])**BCLK**periods. 
                                           **WCLK**=**MCUCLK**/ BDIV*(2*WDIV[9:0]) [Hz] 
                                           If[CLKCTL.WCLKPHASE.*] = 2, User defined. **WCLK**is high WDIV[7:0] (unsigned, [1-255])**BCLK**periods and low WDIV[15:8] (unsigned, [1-255])**BCLK**periods.
                                           **WCLK**=**MCUCLK**/ (BDIV*(WDIV[7:0] + WDIV[15:8]) [Hz]" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="I2S1_BCLKDIV" width="32" offset="0x1168" description="This field configures **BCLK** division ratio">
        <bitfield id="BDIV" description="An unsigned factor of the division ratio used to generate **BCLK** [2-1024]:
                                            **BCLK** = MCUCLK/BDIV[Hz] 
                                            A value of 0 is interpreted as 1024.
                                            A value of 1 is invalid. 
                                            If BDIV is odd and [FMTCFG.SMPLEDGE] = 0, the low phase of the clock is one **MCUCLK** period longer than the high phase. 
                                            If BDIV is odd and [FMTCFG.SMPLEDGE] = 1 , the high phase of the clock is one **MCUCLK** period longer than the low phase." begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>

</module>